{
  "token_to_id": {
    "PAD": 0,
    "BOS": 1,
    "EOS": 2,
    "NOTE_ON_21": 3,
    "NOTE_ON_22": 4,
    "NOTE_ON_23": 5,
    "NOTE_ON_24": 6,
    "NOTE_ON_25": 7,
    "NOTE_ON_26": 8,
    "NOTE_ON_27": 9,
    "NOTE_ON_28": 10,
    "NOTE_ON_29": 11,
    "NOTE_ON_30": 12,
    "NOTE_ON_31": 13,
    "NOTE_ON_32": 14,
    "NOTE_ON_33": 15,
    "NOTE_ON_34": 16,
    "NOTE_ON_35": 17,
    "NOTE_ON_36": 18,
    "NOTE_ON_37": 19,
    "NOTE_ON_38": 20,
    "NOTE_ON_39": 21,
    "NOTE_ON_40": 22,
    "NOTE_ON_41": 23,
    "NOTE_ON_42": 24,
    "NOTE_ON_43": 25,
    "NOTE_ON_44": 26,
    "NOTE_ON_45": 27,
    "NOTE_ON_46": 28,
    "NOTE_ON_47": 29,
    "NOTE_ON_48": 30,
    "NOTE_ON_49": 31,
    "NOTE_ON_50": 32,
    "NOTE_ON_51": 33,
    "NOTE_ON_52": 34,
    "NOTE_ON_53": 35,
    "NOTE_ON_54": 36,
    "NOTE_ON_55": 37,
    "NOTE_ON_56": 38,
    "NOTE_ON_57": 39,
    "NOTE_ON_58": 40,
    "NOTE_ON_59": 41,
    "NOTE_ON_60": 42,
    "NOTE_ON_61": 43,
    "NOTE_ON_62": 44,
    "NOTE_ON_63": 45,
    "NOTE_ON_64": 46,
    "NOTE_ON_65": 47,
    "NOTE_ON_66": 48,
    "NOTE_ON_67": 49,
    "NOTE_ON_68": 50,
    "NOTE_ON_69": 51,
    "NOTE_ON_70": 52,
    "NOTE_ON_71": 53,
    "NOTE_ON_72": 54,
    "NOTE_ON_73": 55,
    "NOTE_ON_74": 56,
    "NOTE_ON_75": 57,
    "NOTE_ON_76": 58,
    "NOTE_ON_77": 59,
    "NOTE_ON_78": 60,
    "NOTE_ON_79": 61,
    "NOTE_ON_80": 62,
    "NOTE_ON_81": 63,
    "NOTE_ON_82": 64,
    "NOTE_ON_83": 65,
    "NOTE_ON_84": 66,
    "NOTE_ON_85": 67,
    "NOTE_ON_86": 68,
    "NOTE_ON_87": 69,
    "NOTE_ON_88": 70,
    "NOTE_ON_89": 71,
    "NOTE_ON_90": 72,
    "NOTE_ON_91": 73,
    "NOTE_ON_92": 74,
    "NOTE_ON_93": 75,
    "NOTE_ON_94": 76,
    "NOTE_ON_95": 77,
    "NOTE_ON_96": 78,
    "NOTE_ON_97": 79,
    "NOTE_ON_98": 80,
    "NOTE_ON_99": 81,
    "NOTE_ON_100": 82,
    "NOTE_ON_101": 83,
    "NOTE_ON_102": 84,
    "NOTE_ON_103": 85,
    "NOTE_ON_104": 86,
    "NOTE_ON_105": 87,
    "NOTE_ON_106": 88,
    "NOTE_ON_107": 89,
    "NOTE_ON_108": 90,
    "NOTE_OFF_21": 91,
    "NOTE_OFF_22": 92,
    "NOTE_OFF_23": 93,
    "NOTE_OFF_24": 94,
    "NOTE_OFF_25": 95,
    "NOTE_OFF_26": 96,
    "NOTE_OFF_27": 97,
    "NOTE_OFF_28": 98,
    "NOTE_OFF_29": 99,
    "NOTE_OFF_30": 100,
    "NOTE_OFF_31": 101,
    "NOTE_OFF_32": 102,
    "NOTE_OFF_33": 103,
    "NOTE_OFF_34": 104,
    "NOTE_OFF_35": 105,
    "NOTE_OFF_36": 106,
    "NOTE_OFF_37": 107,
    "NOTE_OFF_38": 108,
    "NOTE_OFF_39": 109,
    "NOTE_OFF_40": 110,
    "NOTE_OFF_41": 111,
    "NOTE_OFF_42": 112,
    "NOTE_OFF_43": 113,
    "NOTE_OFF_44": 114,
    "NOTE_OFF_45": 115,
    "NOTE_OFF_46": 116,
    "NOTE_OFF_47": 117,
    "NOTE_OFF_48": 118,
    "NOTE_OFF_49": 119,
    "NOTE_OFF_50": 120,
    "NOTE_OFF_51": 121,
    "NOTE_OFF_52": 122,
    "NOTE_OFF_53": 123,
    "NOTE_OFF_54": 124,
    "NOTE_OFF_55": 125,
    "NOTE_OFF_56": 126,
    "NOTE_OFF_57": 127,
    "NOTE_OFF_58": 128,
    "NOTE_OFF_59": 129,
    "NOTE_OFF_60": 130,
    "NOTE_OFF_61": 131,
    "NOTE_OFF_62": 132,
    "NOTE_OFF_63": 133,
    "NOTE_OFF_64": 134,
    "NOTE_OFF_65": 135,
    "NOTE_OFF_66": 136,
    "NOTE_OFF_67": 137,
    "NOTE_OFF_68": 138,
    "NOTE_OFF_69": 139,
    "NOTE_OFF_70": 140,
    "NOTE_OFF_71": 141,
    "NOTE_OFF_72": 142,
    "NOTE_OFF_73": 143,
    "NOTE_OFF_74": 144,
    "NOTE_OFF_75": 145,
    "NOTE_OFF_76": 146,
    "NOTE_OFF_77": 147,
    "NOTE_OFF_78": 148,
    "NOTE_OFF_79": 149,
    "NOTE_OFF_80": 150,
    "NOTE_OFF_81": 151,
    "NOTE_OFF_82": 152,
    "NOTE_OFF_83": 153,
    "NOTE_OFF_84": 154,
    "NOTE_OFF_85": 155,
    "NOTE_OFF_86": 156,
    "NOTE_OFF_87": 157,
    "NOTE_OFF_88": 158,
    "NOTE_OFF_89": 159,
    "NOTE_OFF_90": 160,
    "NOTE_OFF_91": 161,
    "NOTE_OFF_92": 162,
    "NOTE_OFF_93": 163,
    "NOTE_OFF_94": 164,
    "NOTE_OFF_95": 165,
    "NOTE_OFF_96": 166,
    "NOTE_OFF_97": 167,
    "NOTE_OFF_98": 168,
    "NOTE_OFF_99": 169,
    "NOTE_OFF_100": 170,
    "NOTE_OFF_101": 171,
    "NOTE_OFF_102": 172,
    "NOTE_OFF_103": 173,
    "NOTE_OFF_104": 174,
    "NOTE_OFF_105": 175,
    "NOTE_OFF_106": 176,
    "NOTE_OFF_107": 177,
    "NOTE_OFF_108": 178,
    "TIME_SHIFT_0": 179,
    "TIME_SHIFT_1": 180,
    "TIME_SHIFT_2": 181,
    "TIME_SHIFT_3": 182,
    "TIME_SHIFT_4": 183,
    "TIME_SHIFT_5": 184,
    "TIME_SHIFT_6": 185,
    "TIME_SHIFT_7": 186,
    "TIME_SHIFT_8": 187,
    "TIME_SHIFT_9": 188,
    "TIME_SHIFT_10": 189,
    "TIME_SHIFT_11": 190,
    "TIME_SHIFT_12": 191,
    "TIME_SHIFT_13": 192,
    "TIME_SHIFT_14": 193,
    "TIME_SHIFT_15": 194,
    "TIME_SHIFT_16": 195,
    "TIME_SHIFT_17": 196,
    "TIME_SHIFT_18": 197,
    "TIME_SHIFT_19": 198,
    "TIME_SHIFT_20": 199,
    "TIME_SHIFT_21": 200,
    "TIME_SHIFT_22": 201,
    "TIME_SHIFT_23": 202,
    "TIME_SHIFT_24": 203,
    "TIME_SHIFT_25": 204,
    "TIME_SHIFT_26": 205,
    "TIME_SHIFT_27": 206,
    "TIME_SHIFT_28": 207,
    "TIME_SHIFT_29": 208,
    "TIME_SHIFT_30": 209,
    "TIME_SHIFT_31": 210,
    "VELOCITY_0": 211,
    "VELOCITY_1": 212,
    "VELOCITY_2": 213,
    "VELOCITY_3": 214,
    "VELOCITY_4": 215,
    "VELOCITY_5": 216,
    "VELOCITY_6": 217,
    "VELOCITY_7": 218,
    "VELOCITY_8": 219,
    "VELOCITY_9": 220,
    "VELOCITY_10": 221,
    "VELOCITY_11": 222,
    "VELOCITY_12": 223,
    "VELOCITY_13": 224,
    "VELOCITY_14": 225,
    "VELOCITY_15": 226,
    "VELOCITY_16": 227,
    "VELOCITY_17": 228,
    "VELOCITY_18": 229,
    "VELOCITY_19": 230,
    "VELOCITY_20": 231,
    "VELOCITY_21": 232,
    "VELOCITY_22": 233,
    "VELOCITY_23": 234,
    "VELOCITY_24": 235,
    "VELOCITY_25": 236,
    "VELOCITY_26": 237,
    "VELOCITY_27": 238,
    "VELOCITY_28": 239,
    "VELOCITY_29": 240,
    "VELOCITY_30": 241,
    "VELOCITY_31": 242
  },
  "id_to_token": {
    "0": "PAD",
    "1": "BOS",
    "2": "EOS",
    "3": "NOTE_ON_21",
    "4": "NOTE_ON_22",
    "5": "NOTE_ON_23",
    "6": "NOTE_ON_24",
    "7": "NOTE_ON_25",
    "8": "NOTE_ON_26",
    "9": "NOTE_ON_27",
    "10": "NOTE_ON_28",
    "11": "NOTE_ON_29",
    "12": "NOTE_ON_30",
    "13": "NOTE_ON_31",
    "14": "NOTE_ON_32",
    "15": "NOTE_ON_33",
    "16": "NOTE_ON_34",
    "17": "NOTE_ON_35",
    "18": "NOTE_ON_36",
    "19": "NOTE_ON_37",
    "20": "NOTE_ON_38",
    "21": "NOTE_ON_39",
    "22": "NOTE_ON_40",
    "23": "NOTE_ON_41",
    "24": "NOTE_ON_42",
    "25": "NOTE_ON_43",
    "26": "NOTE_ON_44",
    "27": "NOTE_ON_45",
    "28": "NOTE_ON_46",
    "29": "NOTE_ON_47",
    "30": "NOTE_ON_48",
    "31": "NOTE_ON_49",
    "32": "NOTE_ON_50",
    "33": "NOTE_ON_51",
    "34": "NOTE_ON_52",
    "35": "NOTE_ON_53",
    "36": "NOTE_ON_54",
    "37": "NOTE_ON_55",
    "38": "NOTE_ON_56",
    "39": "NOTE_ON_57",
    "40": "NOTE_ON_58",
    "41": "NOTE_ON_59",
    "42": "NOTE_ON_60",
    "43": "NOTE_ON_61",
    "44": "NOTE_ON_62",
    "45": "NOTE_ON_63",
    "46": "NOTE_ON_64",
    "47": "NOTE_ON_65",
    "48": "NOTE_ON_66",
    "49": "NOTE_ON_67",
    "50": "NOTE_ON_68",
    "51": "NOTE_ON_69",
    "52": "NOTE_ON_70",
    "53": "NOTE_ON_71",
    "54": "NOTE_ON_72",
    "55": "NOTE_ON_73",
    "56": "NOTE_ON_74",
    "57": "NOTE_ON_75",
    "58": "NOTE_ON_76",
    "59": "NOTE_ON_77",
    "60": "NOTE_ON_78",
    "61": "NOTE_ON_79",
    "62": "NOTE_ON_80",
    "63": "NOTE_ON_81",
    "64": "NOTE_ON_82",
    "65": "NOTE_ON_83",
    "66": "NOTE_ON_84",
    "67": "NOTE_ON_85",
    "68": "NOTE_ON_86",
    "69": "NOTE_ON_87",
    "70": "NOTE_ON_88",
    "71": "NOTE_ON_89",
    "72": "NOTE_ON_90",
    "73": "NOTE_ON_91",
    "74": "NOTE_ON_92",
    "75": "NOTE_ON_93",
    "76": "NOTE_ON_94",
    "77": "NOTE_ON_95",
    "78": "NOTE_ON_96",
    "79": "NOTE_ON_97",
    "80": "NOTE_ON_98",
    "81": "NOTE_ON_99",
    "82": "NOTE_ON_100",
    "83": "NOTE_ON_101",
    "84": "NOTE_ON_102",
    "85": "NOTE_ON_103",
    "86": "NOTE_ON_104",
    "87": "NOTE_ON_105",
    "88": "NOTE_ON_106",
    "89": "NOTE_ON_107",
    "90": "NOTE_ON_108",
    "91": "NOTE_OFF_21",
    "92": "NOTE_OFF_22",
    "93": "NOTE_OFF_23",
    "94": "NOTE_OFF_24",
    "95": "NOTE_OFF_25",
    "96": "NOTE_OFF_26",
    "97": "NOTE_OFF_27",
    "98": "NOTE_OFF_28",
    "99": "NOTE_OFF_29",
    "100": "NOTE_OFF_30",
    "101": "NOTE_OFF_31",
    "102": "NOTE_OFF_32",
    "103": "NOTE_OFF_33",
    "104": "NOTE_OFF_34",
    "105": "NOTE_OFF_35",
    "106": "NOTE_OFF_36",
    "107": "NOTE_OFF_37",
    "108": "NOTE_OFF_38",
    "109": "NOTE_OFF_39",
    "110": "NOTE_OFF_40",
    "111": "NOTE_OFF_41",
    "112": "NOTE_OFF_42",
    "113": "NOTE_OFF_43",
    "114": "NOTE_OFF_44",
    "115": "NOTE_OFF_45",
    "116": "NOTE_OFF_46",
    "117": "NOTE_OFF_47",
    "118": "NOTE_OFF_48",
    "119": "NOTE_OFF_49",
    "120": "NOTE_OFF_50",
    "121": "NOTE_OFF_51",
    "122": "NOTE_OFF_52",
    "123": "NOTE_OFF_53",
    "124": "NOTE_OFF_54",
    "125": "NOTE_OFF_55",
    "126": "NOTE_OFF_56",
    "127": "NOTE_OFF_57",
    "128": "NOTE_OFF_58",
    "129": "NOTE_OFF_59",
    "130": "NOTE_OFF_60",
    "131": "NOTE_OFF_61",
    "132": "NOTE_OFF_62",
    "133": "NOTE_OFF_63",
    "134": "NOTE_OFF_64",
    "135": "NOTE_OFF_65",
    "136": "NOTE_OFF_66",
    "137": "NOTE_OFF_67",
    "138": "NOTE_OFF_68",
    "139": "NOTE_OFF_69",
    "140": "NOTE_OFF_70",
    "141": "NOTE_OFF_71",
    "142": "NOTE_OFF_72",
    "143": "NOTE_OFF_73",
    "144": "NOTE_OFF_74",
    "145": "NOTE_OFF_75",
    "146": "NOTE_OFF_76",
    "147": "NOTE_OFF_77",
    "148": "NOTE_OFF_78",
    "149": "NOTE_OFF_79",
    "150": "NOTE_OFF_80",
    "151": "NOTE_OFF_81",
    "152": "NOTE_OFF_82",
    "153": "NOTE_OFF_83",
    "154": "NOTE_OFF_84",
    "155": "NOTE_OFF_85",
    "156": "NOTE_OFF_86",
    "157": "NOTE_OFF_87",
    "158": "NOTE_OFF_88",
    "159": "NOTE_OFF_89",
    "160": "NOTE_OFF_90",
    "161": "NOTE_OFF_91",
    "162": "NOTE_OFF_92",
    "163": "NOTE_OFF_93",
    "164": "NOTE_OFF_94",
    "165": "NOTE_OFF_95",
    "166": "NOTE_OFF_96",
    "167": "NOTE_OFF_97",
    "168": "NOTE_OFF_98",
    "169": "NOTE_OFF_99",
    "170": "NOTE_OFF_100",
    "171": "NOTE_OFF_101",
    "172": "NOTE_OFF_102",
    "173": "NOTE_OFF_103",
    "174": "NOTE_OFF_104",
    "175": "NOTE_OFF_105",
    "176": "NOTE_OFF_106",
    "177": "NOTE_OFF_107",
    "178": "NOTE_OFF_108",
    "179": "TIME_SHIFT_0",
    "180": "TIME_SHIFT_1",
    "181": "TIME_SHIFT_2",
    "182": "TIME_SHIFT_3",
    "183": "TIME_SHIFT_4",
    "184": "TIME_SHIFT_5",
    "185": "TIME_SHIFT_6",
    "186": "TIME_SHIFT_7",
    "187": "TIME_SHIFT_8",
    "188": "TIME_SHIFT_9",
    "189": "TIME_SHIFT_10",
    "190": "TIME_SHIFT_11",
    "191": "TIME_SHIFT_12",
    "192": "TIME_SHIFT_13",
    "193": "TIME_SHIFT_14",
    "194": "TIME_SHIFT_15",
    "195": "TIME_SHIFT_16",
    "196": "TIME_SHIFT_17",
    "197": "TIME_SHIFT_18",
    "198": "TIME_SHIFT_19",
    "199": "TIME_SHIFT_20",
    "200": "TIME_SHIFT_21",
    "201": "TIME_SHIFT_22",
    "202": "TIME_SHIFT_23",
    "203": "TIME_SHIFT_24",
    "204": "TIME_SHIFT_25",
    "205": "TIME_SHIFT_26",
    "206": "TIME_SHIFT_27",
    "207": "TIME_SHIFT_28",
    "208": "TIME_SHIFT_29",
    "209": "TIME_SHIFT_30",
    "210": "TIME_SHIFT_31",
    "211": "VELOCITY_0",
    "212": "VELOCITY_1",
    "213": "VELOCITY_2",
    "214": "VELOCITY_3",
    "215": "VELOCITY_4",
    "216": "VELOCITY_5",
    "217": "VELOCITY_6",
    "218": "VELOCITY_7",
    "219": "VELOCITY_8",
    "220": "VELOCITY_9",
    "221": "VELOCITY_10",
    "222": "VELOCITY_11",
    "223": "VELOCITY_12",
    "224": "VELOCITY_13",
    "225": "VELOCITY_14",
    "226": "VELOCITY_15",
    "227": "VELOCITY_16",
    "228": "VELOCITY_17",
    "229": "VELOCITY_18",
    "230": "VELOCITY_19",
    "231": "VELOCITY_20",
    "232": "VELOCITY_21",
    "233": "VELOCITY_22",
    "234": "VELOCITY_23",
    "235": "VELOCITY_24",
    "236": "VELOCITY_25",
    "237": "VELOCITY_26",
    "238": "VELOCITY_27",
    "239": "VELOCITY_28",
    "240": "VELOCITY_29",
    "241": "VELOCITY_30",
    "242": "VELOCITY_31"
  },
  "config": {
    "min_pitch": 21,
    "max_pitch": 108,
    "n_velocity_bins": 32,
    "n_time_bins": 32,
    "ticks_per_bin": 4,
    "vocab_size": 243
  }
}